#ДомашнееЗадание №24

Написать модуль, содержащий две функции: numbers_reading и average_value.

На вход функции numbers_reading поступает строка с названием файла. Внутри функции из файла считываются числа с плавающей точкой. На выход поступает список со считанными числами.

На вход функции average_value поступает список с числами. На выход поступает среднее значение всех чисел.

Написать программу, которая подключает модуль с функциями numbers_reading и average_value. Затем запрашивает у пользователя название файла, считывает из него числа и выводит на экран их среднее значение.