# -*- coding: utf-8 -*-
"""homme19_strings_triangles.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1xjhJvsB4j97iL-4Dj3tsYyS0wJdJNEgY
"""



"""# Равнобедренные треугольники

Пользователь вводит число N от 2 до 6.

Требуется вывести на экран N равнобедренных треугольников высотой в N строк, расположенных горизонтально. Пустое пространство обозначается символом "-", а треугольники "x".

Проверка

Входные данные:
2
Правильный ответ:
```
-x---x--
xxx-xxx-
```

New Section
Входные данные:
3
Правильный ответ:
```
--x-----x-----x---
-xxx---xxx---xxx--
xxxxx-xxxxx-xxxxx-
```
Входные данные:
4
Правильный ответ:
```
---x-------x-------x-------x----
--xxx-----xxx-----xxx-----xxx---
-xxxxx---xxxxx---xxxxx---xxxxx--
xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx-
```
"""



N = int(input("Рисую равнобедренные треугольники, N - штук по N строк каждый: "))

def Line(N, step, debug=False):
  '''
  Makes one line for triangle task, N - is Triangle size, step - line number
  '''
  s=''
  if debug: print('[',N*2-1,']',N-step,'<=i<=',N+step-2, end=': ')
  for i in range(N*2-1):
     if N-step <= i <= N+step-2:
        s = s + '^'
     else:
        s = s + '-'
  
  ss=''
  for k in range(N):
     ss = ss + s
  return(ss)

#print("Test Line(1,1): ", Line(1,1,debug=True))

#print("Test Line(2,1): ", Line(2,1,debug=True))
#print("Test Line(2,2): ", Line(2,2,debug=True))

#print("Test Line(2,1): ", Line(3,1,debug=True))
#print("Test Line(2,2): ", Line(3,2,debug=True))
#print("Test Line(2,2): ", Line(3,3,debug=True))

def Triangle(N):
  '''
  Draws all triangle's lines
  Uses Line()
  '''
  for i in range(N):
    print(Line(N,i+1))

#Triangle(2)
#Triangle(3)
#Triangle(4)

Triangle(N)