#ДомашнееЗадание №27

Статистический анализатор файлов

Написать программу, которая:
1. Находит в текущем каталоге все файлы с расширением "txt". 
2. Для этих файлов составляет список всех слов, встречающихся в них. Слова - непрерывная последовательность из русских букв. 
3. Для каждого слова подсчитывает, сколько раз оно встречается во всех файлах.
4. Статистику по всем словам записывает в файл "statistics". В каждой строчке записывается следующая информация:
"слово" количество_слов_в_файлах процент_от_всех_слов
Строчки отсортированы по убыванию процента.