#ДомашнееЗадание №25

Калькулятор

На вход программы поступает срока, содержащая числа с плавающей точкой и математические операции '+', '-', '*', '/'. Например: "123.4+56*7". 

Написать модуль, содержащий следующие функции:
1. Извлечение из строки чисел с плавающей запятой и возврат списка этих чисел.
2. Извлечение из строки математических операций и возврат списка символов этих операций.
3. Выполнение математической операции для двух чисел. На вход поступают два числа и символ операции. На выход поступает результат операции.

Написать программу, которая подключает модуль с функциями, получает от пользователя строку, разбирает её на числа и операции, выполняет операции над числами и выводит результат на экран. Учесть приоритет математических операций.