#ДомашнееЗадание №28

Создать класс student.
• Объект класса student содержит поля: 
- фамилия и инициалы,
- номер группы,
- успеваемость (список с оценками, которые могут принимать значение от 1 до 5)
• У класса есть конструктор, на вход которого поступают значения полей "фамилия и инициалы" и "номер группы".
• У класса есть метод, принимающий список с оценками и инициализирующий поле "успеваемость".
• У класса есть метод, возвращающий среднее значение всех оценок.
• У класса есть метод, выводящий на экран всю информацию о студенте.
• У класса есть общее поле - счётчик количества студентов.

Написать программу, которая запрашивает у пользователя информацию о студентах, пока он не введёт "end". По введённым данным создаётся список объектов класса student. Затем программа сортирует этот список по среднему значению оценок студентов и выводит итоговый список на экран.

Дополнительно можно сделать запрос на минимальный средний балл и удалить из списка студентов с баллом ниже минимального. Вывести на экран новый список.